/*
 * A. Hello, World!
Ограничение времени	1 секунда
Ограничение памяти	256Mb
Ввод	стандартный ввод или input.txt
Вывод	стандартный вывод или output.txt
Первая задача первого контеста две тысячи двадцать третьего года. В ваших силах сделать все, чтобы она не стала последней.

Итак, выведите "Hello, World!".

Формат ввода
Вводить ничего не требуется

Формат вывода
Выведите "Hello, World!".
 */
#include <iostream>

int main() {
  std::cout << "Hello, World!";
  return 0;
}
