/*
 * L. Скидки
Ограничение времени	1 секунда
Ограничение памяти	256Mb
Ввод	стандартный ввод или input.txt
Вывод	стандартный вывод или output.txt
В супермаркете проводится беспрецедентная акция – «Покупая два любых товара, третий получаешь бесплатно*», а внизу мелким шрифтом приписано «* - из трех выбранных вами товаров оплачиваются два наиболее дорогих».
Вася, идя в супермаркет, определился, какие товары он хочет купить, и узнал, сколько они стоят. Помогите ему определить минимальную сумму денег, которую ему нужно взять с собой, чтобы в итоге стать счастливым обладателем этих товаров.

Формат ввода
Во входном файле задано сначала число n (1≤n≤1000), а затем n чисел – стоимости выбранных Васей товаров. Все стоимости – натуральные числа, не превышающие 10^4.
Формат вывода
Выведите одно число – сумму денег, которую Вася должен взять с собой в супермаркет (минимально возможную).
 */