/*
# H(4). НнвП [АиСД-23]

Ограничение времени: 1 секунда
Ограничение памяти: 256.0 Мб
Ввод: стандартный ввод или input.txt
Вывод: стандартный вывод или output.txt

## Маша строит последовательность

Зачем мне гаммы? Я и так сыграю. Пусть музыка играет…

Маша, благодаря помощи студентов ИнгГУ, ИРНИТУ, МарГУ, ПГНИУ, ПсковГУ, УУНиТ и ЮУрГУ стала топовым программистом.

Она уже не бегает за Мишкой. Теперь Медведь бегает за Машей с просьбами настроить принтер или сделать сайт.

Все мы знаем, что Маша, сдавшая экзамен в Сетевом Бакалавриате, не просто ИТ-шник, она крутой разработчик и умеет находить длину невозрастающей подпоследовательности! Помогите Маше найти решение!

Дано целое число 1 ≤ N ≤ 10^5 и массив длины N, содержащий неотрицательные целые числа, не превосходящие 10^9.

Найдите наибольшую невозрастающую подпоследовательность в массиве.

На первой строке выведите длину этой подпоследовательности, на второй выведите её индексы 1 ≤ i1 < i2 < … < ik ≤ n (таким образом, A[i1] ≥ A[i2] ≥ … ≥ A[in]).

Если подходящих подпоследовательностей несколько, выведите любую из них.

## Пример

Ввод:
```
5
5 3 4 4 2
```
Вывод:
```
4
1 3 4 5
```
 */